import matplotlib.pyplot as plt
import numpy as np

plt.rcParams['font.family'] = "Malgun Gothic"
plt.rcParams["axes.unicode_minus"] = False

fig, ax = plt.subplots(2, 2, figsize=(10, 8))

fig.suptitle("기본 차트 4가지", fontsize=14, fontweight='bold')

ax00 = ax[0][0]
ax01 = ax[0][1]
ax10 = ax[1][0]
ax11 = ax[1][1]

# 선 : 시간흐름, 추세선
months = np.arange(1, 13, 1)
sales = [40, 42, 55, 60, 72, 85, 90, 88, 76, 65, 50, 45]
ax00.plot(months, sales)
ax00.set_title("선 그래프")

# 막대 : 카테고리 비교
menu = ["아메리카노", "아이스티", "민트초코티", "버블티", "오이쉐이크"]
sales = [456,845,123,984,521]
ax01.bar(menu, sales)
ax01.set_title("막대 그래프")

# 산점도 : 두 변수 관계

# 키 (단위: cm)
h = [
    164.3,
    152.7,
    163.2,
    192.5,  # [이상치 1] 매우 큰 키 대비 저체중
    160.7,
    172.0,
    173.9,
    169.9,
    165.7,
    164.2,
    166.2,
    151.8,  # [이상치 2] 상대적으로 작은 키 대비 고체중
    164.3,
    169.4,
    166.1,
    166.9,
    180.6,
    171.0,
    172.0,  # [이상치 3] 단순 입력 오류 (오타)
    163.6,
    182.8,
    163.5,
    158.2,
    158.8,
    174.1,
    179.7,
    201.2,  # [이상치 4] 극단적인 체격 (우상단 레버리지 포인트)
    180.2,
    156.6,
    156.2,
    166.1,
    159.9,
    169.7,
    154.2,
    165.6,
    168.9,
    152.3,
    169.6,
    172.3,
    167.9,
    159.5,
    168.5,
    167.1,
    156.7,
    170.5,
    157.4,
    174.6,
    163.2,
    173.2,
    162.2,
]

# 몸무게 (단위: kg)
w = [
    50.5,
    49.7,
    54.1,
    53.8,  # [이상치 1]
    55.7,
    58.9,
    67.4,
    61.1,
    59.9,
    59.8,
    61.3,
    91.5,  # [이상치 2]
    53.1,
    60.6,
    54.3,
    62.1,
    65.2,
    68.2,
    18.5,  # [이상치 3]
    55.9,
    68.9,
    53.0,
    51.3,
    49.8,
    66.1,
    67.4,
    124.0,  # [이상치 4]
    59.3,
    44.9,
    48.2,
    57.8,
    45.4,
    66.6,
    43.7,
    58.3,
    66.2,
    41.9,
    56.6,
    66.1,
    58.2,
    40.7,
    60.1,
    54.4,
    55.0,
    54.0,
    44.7,
    62.3,
    40.6,
    63.9,
    57.7,
]
ax10.scatter(h, w)
ax10.set_title("산점도")

#히스토그램 : 한 변수 분포
scores = np.random.default_rng(42).normal(70,15,300)
ax11.hist(scores, bins=10)
ax11.set_title("히스토그램")


plt.show()